{
  "backend/main.mo": "Defines the backend actor for users, tasks, reminders, completions, rewards, and access control, including user profile management and task-related types and storage maps.",
  "feature_evidence.json": "Lists feature evidence entries mapping UI redesign tasks to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides concise human‑written summaries of major frontend files and their roles in the game‑styled UI.",
  "frontend/DESIGN_DELIVERABLES.md": "Outlines the app’s design structure, navigation flow, and core screen definitions for TaskQuest.",
  "frontend/index.css": "Defines global CSS variables, dark/light palettes, and base Tailwind styling overrides including motion‑reduction rules.",
  "frontend/index.html": "Basic HTML shell that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router, authentication gating, layout, and routing for all pages in the app.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides login/logout button logic using Internet Identity with status handling and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for initial user profile creation with display name input and hooks to initialize the user profile.",
  "frontend/src/components/completions/CompleteTaskFlowDialog.tsx": "Multi‑step dialog for submitting task proof, reflection, and triggering reward animations after completion.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with navigation, mobile menu, header HUD, and user XP progress display.",
  "frontend/src/components/rewards/RewardCelebration.tsx": "Full‑screen reward animation showing earned XP, coins, and bonuses, auto‑closing after a delay.",
  "frontend/src/components/tasks/TaskCard.tsx": "Displays a task with metadata and provides actions for editing, deleting, and completing it.",
  "frontend/src/components/tasks/TaskEditorDialog.tsx": "Dialog for creating or editing tasks with fields for title, description, metadata, and saving changes.",
  "frontend/src/components/tasks/TaskFiltersBar.tsx": "Filter bar allowing users to filter tasks by priority and category.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Wraps children with NextThemesProvider to enable theme switching.",
  "frontend/src/hooks/reminders/useReminderEngine.ts": "Polling hook that triggers reminder notifications for due tasks and tracks dismissed reminders.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user's profile and role using the actor and exposes authentication and loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login, and logout via a React context backed by Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for tasks, completions, rewards, and related mutations using the backend actor.",
  "frontend/src/index.css": "Defines a dark game‑themed Tailwind CSS design system with custom colors, components, and UI effects.",
  "frontend/src/main.tsx": "Initializes React, query client, and Internet Identity provider before rendering the app.",
  "frontend/src/pages/AvatarPage.tsx": "Displays the user’s current avatar level and progression stages with themed UI components.",
  "frontend/src/pages/HistoryPage.tsx": "Shows the user’s task completion history with timestamps, proofs, and reflections.",
  "frontend/src/pages/HomePage.tsx": "Displays the main dashboard with greeting, user XP, task stats, and next due tasks using user and task queries.",
  "frontend/src/pages/InsightsPage.tsx": "Shows productivity insights with task and completion stats plus simple recommendation cards.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with login button, feature highlights, and hero visuals for onboarding new users.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays personal leaderboard stats and weekly progress for the logged-in user.",
  "frontend/src/pages/OnboardingPage.tsx": "Guided multi‑step onboarding flow collecting goals and preferences before navigating to the app.",
  "frontend/src/pages/QuestsPage.tsx": "Shows daily quests and a weekly boss challenge with progress bars and rewards.",
  "frontend/src/pages/ReminderCenterPage.tsx": "Displays active and upcoming reminders, grouping them by scheduled time and linking each to its task.",
  "frontend/src/pages/RewardsPage.tsx": "Shows user XP, coins, badges, and reward history with tabs for badges, history, and weekly chest.",
  "frontend/src/pages/SettingsPage.tsx": "Provides UI for changing theme, sound, music, and motivation style preferences.",
  "frontend/src/pages/StoryPage.tsx": "Renders story mode progress and a list of chapters with unlock and completion status.",
  "frontend/src/pages/TasksPage.tsx": "Fetches and displays user tasks with filtering, task creation, and editing via dialog.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based parsing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, extended theme colors, animations, shadows, and plugin usage.",
  "project_state.json": "Project metadata describing scope, UI direction, required images, and a list of existing implemented features with versioning."
}